{
    "c4p": {
        "image": "/images/posts/kulturbrauerei.jpg",
        "content": "The first summit of the year will be held in Berlin: <br><br>You can read about the inaugural edition of the Beam Summit Europe [here](https://beam.apache.org/blog/2018/10/31/beam-summit-aftermath.html).",
        "title": "Beam Summit Europe 2019",
        "brief": "We are super excited to announce the second European Beam Summit, which will take place in _Berlin_, _June 19-20th of 2019_.",
        "published": "2019-03-01",
        "backgroundColor": "#3647a5",
        "source": "data/posts/2019-03-03-beam-summit-eu-2019.md"
    },
    "summit_motivation2": {
        "brief": "How can **you** get involved in the summits and what is happening the next few months?",
        "title": "Get involved!",
        "published": "2019-05-03",
        "backgroundColor": "#3647a5",
        "image": "/images/backgrounds/audience.jpg",
        "content": "The first summit of the year will be held in Berlin: ![Beam Summit Berlin banner](/images/posts/banner.jpg)<br><br>You can read about the inaugural edition of the Beam Summit Europe [here](https://beam.apache.org/blog/2018/10/31/beam-summit-aftermath.html). At these summits, you have the opportunity to meet with other Apache Beam creators and users, get expert advice, learn from the speaker sessions, and participate in workshops. <br><br> We strongly encourage you to get involved again this year! You can participate in the following ways for the upcoming summit in Europe: <br>🎫 If you want to secure your ticket to attend the Beam Summit Europe 2019, check our [event page](http://beam-summit-europe.eventbrite.com).<br>💸 If you want to make the Summit even **more** awesome, check out our [sponsor booklet](https://drive.google.com/file/d/1R3vvOHihQbpuzF2aaSV8WYg9YHRmJwxS/view)!<br><br>We also launched the CfP for our Beam Summit in North America, which will be held in collaboration with [ApacheCon](https://www.apachecon.com).<br>🎤 If you want to give a talk, take a look at our [CfP](https://www.apachecon.com/acna19/cfp.html).<br>Stay tuned for more information on the summit in North America and Asia.<br><br>**Why community engagement matters**<br> Why we need a strong Apache Beam community: <br> - We're gaining lots of code contributions and need committers to review them.<br> - We want people to feel a sense of ownership to the project. By fostering this level of engagement, the work becomes even more exciting.<br> - A healthy community has a further reach and leads to more growth. More hours can be contributed to the project as we can spread the work and ownership.<br> <br> Why are we organizing these summits: <br> - We’d like to give folks a place to meet, congregate, and share ideas.<br> - We know that offline interactions often changes the nature of the online ones in a positive manner.<br> - Building an active and diverse community is part of the Apache Way. These summits provide an opportunity for us to engage people from different locations, companies, and backgrounds.<br>"
    }
}